app/views/tasks/new.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user_id, "Task Owner" %>
    <%= form.collection_select :user_id,
        User.all,
        :id,
        :name,
        prompt: "Select Task Owner" %>