app/controllers/tasks_controller.rb

  def index
    @task = Task.all
---
SELECT "tasks".* FROM "tasks"

  def details
    @task = nil

    if params[:query].present?
      @task = Task.find_by(tittle: params[:query])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."tittle" = 'vfv' LIMIT 1

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 2 LIMIT 1
UPDATE "tasks" SET "updated_at" = '2026-08-30 17:29:04.429678', "description" = 'this task is about navbar' WHERE "tasks"."id" = 2

  def create
    @task= Task.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at", "tittle", "description", "status", "priority") VALUES ('2026-08-31 06:25:41.285294', '2026-08-31 06:25:41.285294', 'task2', 'create a dashboard for the task app ', 'in-progress', 'medium') RETURNING "id"